tap "github/gh"
tap "koenbollen/public"
tap "teamookla/speedtest"
tap "warrensbox/tap"

cask_args appdir: "/Applications", require_sha: true

# ============== Shell ==============

brew "bash"
brew "bat"
brew "coreutils"
brew "curl"
brew "dasel"
brew "difftastic"
brew "direnv"
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "hyperfine"
brew "jless"
brew "jq"
brew "just"
brew "jwt-cli"
brew "koenbollen/public/jl"
brew "lazygit"
brew "neovim"
brew "openssh"
brew "readline"
brew "ripgrep"
brew "stow"
brew "teamookla/speedtest/speedtest"
brew "tmux"
brew "vim"
brew "wget"
brew "yq"
brew "zoxide"

# =========== Development ===========

brew "bash-language-server"
brew "bazelisk"
brew "buildifier"
brew "buf"
brew "checkbashisms"
brew "clang-format"
brew "cmake"
brew "colima"
brew "docker"
brew "docker-buildx", postinstall: "mkdir -p $HOME/.docker/cli-plugins && ln -sfn /opt/homebrew/opt/docker-buildx/bin/docker-buildx $HOME/.docker/cli-plugins/docker-buildx"
brew "docker-compose", postinstall: "mkdir -p $HOME/.docker/cli-plugins && ln -sfn /opt/homebrew/opt/docker-buildx/bin/docker-compose $HOME/.docker/cli-plugins/docker-compose"
brew "golang"
brew "gopls"
brew "helm"
brew "kubernetes-cli"
brew "kind"
brew "luarocks"
brew "lua-language-server"
brew "ninja"
brew "node"
brew "qemu"
brew "ruff"
brew "rust-analyzer"
brew "shellcheck"
brew "shfmt"
brew "staticcheck"
brew "stylua"
brew "terraform-ls"
brew "tree-sitter"
brew "ty"
brew "typescript-language-server"
brew "uv"
brew "warrensbox/tap/tfswitch"
brew "yaml-language-server"

# ============== Fonts ==============

cask "font-anonymous-pro"
cask "font-anonymice-nerd-font"

# ============== Apps ===============

cask "1password-cli"
cask "1password"
cask "alacritty", postinstall: "$HOME/scripts/bin/macos/.local/bin/codesign-alacritty"
cask "alfred"
cask "apparency"
cask "archaeology"
cask "chatgpt" if Hardware::CPU.arm?
cask "codex"
cask "codex-app" if Hardware::CPU.arm?
cask "google-chrome"
cask "hex-fiend"
cask "istat-menus"
cask "mos"
cask "spotify"
cask "stay"
cask "suspicious-package"
